Revit 2027 API
SegmentOverrideType Enumeration
 The override types of analytical segment pressure drop calculation.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum SegmentOverrideType
Public Enumeration SegmentOverrideType
public enum class SegmentOverrideType
type SegmentOverrideType
Members
Member name | Value | Description
None | 0 |  The segment calculation is not overridden.
OverrideLossCoefficient | 1 |  The segment loss coefficient is overridden.
OverridePressureDrop | 2 |  The segment pressure drop is overridden.
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace